# Lookup Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorManager..::..Lookup Method
ConnectorManager Class See Also
---
Lookup the connector using the unique index value that identify this connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Connector Lookup(
	int index
)
```

Visual Basic
---
```text
Public Function Lookup ( _
	index As Integer _
) As Connector
```

Visual C++
---
```text
public:
Connector^ Lookup(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The unique index value.
# ### Return Value
Returns the connector or null if a connector for the provided unique index value doesn't exist.
# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace